[
  {
    "author": "sbpotdbot",
    "body": "**If you choose to self promote (tips excluded) in the POTD thread:** You must have accurate tracking of your full POTD record with detailed stats including **ROI+average odds+units won** written into the comment. No resetting records. **|** For picks that do not fit the POTD rules use the Daily Discussion posts.",
    "upvotes": 1
  },
  {
    "author": "ALittleBirdie117",
    "body": "**POTD Record** 21-8-2 (**+13.30 Units**)\n\n**POTD Recap:** Jonathan Marchessault over 0.5 Points **W** ☄️ \n\nThe man can not stop. He will not stop. And I’m looking forward to targeting him the rest of the postseason. The connection with Eichel is undeniable.\n\n**Streak:** ✅✅✅✅✅ 5 in a row baby!\n\n**POTD Friday:** Tom Hoge to defeat Chris Kirk (+100) Round 2 2-Balls Charles Schwab Challenge 10:55 AM MST 2 Units\n\nBack to the links ⛳️ where a lot of bread has been made this year. This shorter course in Fort Worth has always been a safe home to the diminutive players on tour setting up well for both players here. While Chris Kirk isn’t out of form he did nothing well striking the ball or putting on Thursday in his round of 72. Hoge was 6 strokes better and the stats show why. Hoge was the best player on the course tee to green on Thursday via data golf gaining an astonishing 4.39 strokes on his approach. While many pegged Kirk as a course fit here I believe the same for Hoge and with Hoge in essence lapping Kirk in every measurable category on Thursday I think it’s an uphill battle for Kirk to catch him tomorrow. Love the +100 odds.\n\nI’m on DK>Charles Schwab Challenge>Matchups>Round 2-Balls\n\n**Tips for the streak:** https://www.buymeacoffee.com/ALittleBirdie",
    "upvotes": 30
  },
  {
    "author": "gidarigoitjiman",
    "body": "**POTD Record 1-0: +3.13U**\n\n**Last POTD:** 🎾  **Lucas Pouille (+125) 2.5U (RG Qualifiers)**\n\n**Today's POTD:**  🎾 **Fils vs. Nakashima Over 22.5 Games (-110) 2U (ATP Lyon)**\n\n**Reason:** While Nakashima is no clay court specialist his run in this tournament has been impressive. On the other hand Fils has only played through three sets managing to get two walkover wins back to back. While he's gotten to the semifinals once again Fils has yet to win one on the tour. He's been lucky, but the clay is his game and these last two walkovers has given him lots of rest. Now up against Nakashima who is no slouch, this will be a test just like his previous meetings with Bonzi and Sinner in those two semifinal matches. This match is evenly poised in my opinion, and can go either way. Both men are equally capable of winning this match, which is why I'm taking the over.",
    "upvotes": 23
  },
  {
    "author": "MoreUnits4You",
    "body": "**PoTD Record: 13-3, +8.61u**\n\nLast Pick: FK Buducnost Podgorica ML vs Mornar @ -110 ✅\n\n**Today’s Pick: Phoenix Rising FC ML vs Las Vegas Lights FC @ -190**\n\n(25 hours from this post)\n\nHey All - Back at it today with the daily football/soccer play. The FK Buducnost play @ -110 was a hit and we seemingly jumped on an error by the sportsbooks if you managed to get in early enough as it peaked around -270. Based on the outpouring of private messages it seems like a lot of people took that winner so thrilled to hear that. \n\nWith that being said, we’re going to tackle another lesser known league - USL Championship (USA). This is the second division of football here in the US and has a ton of smaller market teams that play in some fairly fun games. It’s worth noting I’m betting this on FanDuel here in the US. Knowing that there are a lot of international redditors here as well as redditors from all over the US, this may actually be obscure enough that it is not able to be bet where you are. Apologies if that’s the case - we’re going back to European Top 5 Leagues tomorrow!\n\nWith respect to the game, there’s really two angles here. First and, perhaps less importantly, the Las Vegas Lights are last in the Western Division of the USL with a record of 0-6-4 through 10 games. In 8 of their 10 games this season, they’ve only scored 1 goal or less but have managed to snag a ton of draws which shows some of their defensive formidability. Phoenix Rising is in the upper half of the table in the Western Conference (4-4-2, 16pts through 10 games) and following an uncharacteristic season last year they typically are a dominant team in the USL (Fun fact: this team became popular when Didier Drogba became a big investor and played for them for two seasons a few years ago).\n\nThe second angle to this bet is that it’s $1 Beer Night. Stick with me here as this isn’t a joke. Phoenix Rising FC is 16-0-0 in their $1 Beer Night promotion. This promotion became a huge deal several years ago where they were essentially unbeatable on this night haha. During the last several seasons (USL did not play in 2020), $1 Beer Night was not a promotion that was done and it was brought back this year for the home opener - another game they won. \n\nSo with all the being said, it should be a raucous night in Phoenix on Friday night. The home support should be plentiful (and electric I would have to assume). Couple this with the fact that the opposition has not won a game all year and we have ourselves a Play of The Day.\n\nAs I said, apologies if this game is not available to everyone and apologies for picking a game 25 hours away! For those that do tail, bet responsibly and lock in quickly. With it already being at -190 this line is bound to rise to a point where it’s unplayable. See you all tomorrow. \n\n**1 Unit Play**\n\nBest of Luck!",
    "upvotes": 21
  },
  {
    "author": "mitp971",
    "body": "Record 4-0   \n\nLast pick- Mumbai Indians to win against Lucknow Super Giants- 3U (-148) = W 😍💰\n\nSports- cricket 🏏 \nTournament- IPL \n\nToday’s Pick- Gujarat Titans to win against Mumbai Indians - 2U (-116) starts 10:00 am EST😩\n\nExplanation- Let’s get it 🤑 Mumbai Indians is playing Gujarat Titans tomorrow. Now many people here would say it’s going to be a close game and I agree but let me be serious here both teams got good batsman's but Gujarat Titans got way better bowlers than Mumbai Indians. So I am going with Gujarat all the way baby 😘 I know I said it my last pick that Mumbai is crazy team and they’ll show that tomorrow by losing tomorrow 😂 They are going home baby. Let me tell you guys something about Gujarat’s team they are Mumbai’s daddy. Now I don’t wanna write a whole essay. Tail or fade baby good luck 😘",
    "upvotes": 35
  },
  {
    "author": "Narrow-Sympathy8470",
    "body": " \n\nPOTD Record: 29-15\n\n**Units Won**: +23.9U; **ROI**: 21%; **Average Odds: (-120)**\n\nLast 10 (newest on Left): ✅❌✅❌✅ ❌ ❌ ✅ ✅✅\n\nTodays POTD: **Sharks vs. Endpoint O 2.5 maps (+100)**\n\n5U to win 5U\n\n&#x200B;\n\nReally a big fan of this pick on paper.  \n\n\nEndpoint are a solid tier two team but not enough to blow out Sharks, Sharks are actually a sleeper strong team from Brazil with great players and fundamentals. \n\n&#x200B;\n\nSharks ban Overpass (perma ban)\n\nEndpoint ban Nuke (perma ban)\n\n  \n**Sharks pick Ancient** (88% winrate in 16 games vs. Endpoint 25% winrate in 12 games)\n\n**Endpoint pick Inferno** (65% winrate in 20 games vs. Sharks 44% winrate in 9 games)\n\n&#x200B;\n\nSharks are a dominant Ancient team and are consistently beating better teams then them on the map. While Sharks do have inflated map stats, that doesn't change how good the strats and ability they bring to the map are. Sharks do have slightly inflated map stats from playing in Brazil and they only have one negative winrate map which is Inferno which is also Endpoint best map. This pick feels like a gift, getting it at even money feels like a steal, sometimes O 2.5 map bets can be unpredictable but the numbers and the recent gameplay screams this pick\n\n&#x200B;\n\n**Best of Luck!**  \n\n\nIf anyone needs help finding a legal book to bet esports lmk! Happy to help and continue to grow the community",
    "upvotes": 14
  },
  {
    "author": "BasedTog",
    "body": "Record: 3-0\n\nLast POTD: Jamayne Isaako to score anytime @1.77 / -130 ✅️\n\nTodays POTD:\n\nSport: National Rugby League (NRL)\n\nEvent: Parramatta Eels vs. North Queensland Cowboys\n\nTime: 8 pm EST / 6 am EDT (7ish hours from now)\n\nMaika Sivo to score anytime @ -200 / 1.50\n\nReasoning: Not the best odds today, but I'm very confident. Sivo has been an absolute animal this season, scoring 14 tries in his 12 appearances and is the leading try scorer in the entire league in 2023. Furthermore, the Eels face off against a depleted Cowboys side with multiple key players out. I expect Eels to beat the Cows comfortably, and I don't see an outcome where Sivo doesn't score if they do.\n\nAll bets are 1U unless otherwise indicated. GL",
    "upvotes": 7
  },
  {
    "author": "sluttywife-happylife",
    "body": "**POTD Record: 18-4 | Profit: +39.45u | Form: ✅ ✅ ✅ ✅ ✅ ✅ ✅ 💀 ✅ ✅**\n\n\\-----\n\nPrevious POTD: 4u btts (Girona FC at RC Celta de Vigo) \\[-139\\] ✅\n\nCalled it! Girona love to score and concede. 1-1 (FT) ✅\n\n\\-----\n\nToday's POTD: Shamrock Rovers F.C. at Cork City F.C.\n\n**4u bet: Shamrock Rovers tt o1.5 \\[-152\\]**\n\nReason: Shamrock Rovers love to score and Cork City love to concede in Irish Premier Division. Last 15 games: Shamrock Rovers scored 2 or more goals in 12/15 and 34 goals in total, Cork City conceded 2 or more goals in 10/15 and 31 goals in total. Cork City's defensive players Coleman and Healy are out of action. That eases it up for Shamrock Rovers to put up numbers on the scoreboard.\n\n\\-----\n\nBOL",
    "upvotes": 6
  },
  {
    "author": "DuaLipasHipShake",
    "body": "**POD Record: 31-22 +24.85U**\n\nL10 (Recent first): ✅❌✅❌✅✅❌✅❌✅\n\n**Prior Pick: Caleb Martin OVER 12.5 points. Betting 4.16U to win 4U at -104**\n\nHE DOES IT AGAIN. CALEB MARTIN THE BOOKS UNDERRATE HIM. SWEAT FREE FOURTH QUARTER. LETS GOOOOOOOO\n\n**Todays Pick: LA Dodgers vs Tampa Bay Rays OVER 9.5 Runs scored. Betting 1.15U to win 1U at -115**\n\nBoth teams bats have been hot. Both teams recent games totals have been high. I like this game to be a high scoring affair as well and hit 12-14 runs total. \n\nHope you’ve been able to tail profitably, tips are always appreciated [Buy Me A Beer](https://www.buymeacoffee.com/DLHS)\n\nCashApp: $DuaLipasHip\n\nBet responsibly\n\nEditing: messed up my days and had a match on Sunday. Pick to come shortly…",
    "upvotes": 16
  },
  {
    "author": "bobdylan1209",
    "body": "POD record (3-2) (+2.4U) \n\nAll plays 1U unless otherwise noted\n\nLast POD - cardinals -1.5 (L) \n\nWhat a tough loss here, 2 outs and a run is scored to fuck us at the very end. Gotta give credit to both pitchers for a stellar outing. \n\nTodays POD - Nationals +112 \n\nAlthough I’ve been an active member of fading Corbin, he has been great in the month of May. 2-1 with 25 IP and 8 ER. After a tough loss today, and too many RISP left on base I’m expecting a bounce back day. \n\nLyles on the other hand has been  garbage all year long. 8.27 ERA, and 8.86 in May. Last two outings allowing a total of 11 runs in 7.1 IP against a weaker Milwaukee and White Sox. \n\nAs always BOL, hoping for better luck today.\n\nDon't ever expect tips but it's always appreciated!\n\nCashapp - bobdylan1209\n\n[Post grad beers]\n(https://www.buymeacoffee.com/collegestudent3)",
    "upvotes": 12
  },
  {
    "author": "zMastroo",
    "body": "**POTD |** **Record of 19-33** **|** **ROI : -17.56 units | Average Odds: 2.04**\n\n**Current form:** ❌✅❌❌❌❌❌✅❌❌\n\nPrevious Pick:  Premier League| Manchester United vs. Chelsea | Manchester United to Win & Under 4.5 Goals ❌\n\nNew Pick: Ligue 2| FC Sochaux vs. Metz| 11:45am PST\n\n**Metz to Win| 1.61 odds**\n\nBetting 1U to win 0.61U\n\n\\--------------------------\n\n***Recap:*** Rough way to lose. With the pick looking great, 3 goals sprung up in the last 17 minutes of play. Tough loss and we move on. Can't really predict a 5 goal game unfortunately, especially when the stats were so in favour of a low scoring game. Guess Chelsea really are trash.\n\n**Summary:** Bit of a boring pick today but after getting burned yesterday, simple may be safer. Metz is looking for promotion into Ligue 1 and Sochaux has given up their race for promotion. In the Head-to-Head (6 matches), Metz has won 4 out of 6 matches, with the other two ending in draws.\n\nSochaux has never beat Metz. Sochaux is also on a 6 game losing streak, a streak I expect to continue tomorrow.\n\nMetz are unbeaten in 23 Ligue 2 games heading into this clash and have won 14 of those, including four wins in their last six away games.\n\n\\--------------------------\n\n***TLDR Metz should win and keep their hopes for promotion alive***\n\n**FC Sochaux vs. Metz | Metz to Win| 1.61 odds**",
    "upvotes": 10
  },
  {
    "author": "cusephenom",
    "body": "**KBO Record: Overall 140-153-8** (Streak LLLL, Last 10: 3-7) Down 17.99u over 301 KBO picks, 47.8% success rate, -6.14% ROI (This season 21-21-1, 50.0% success rate, Up 0.86u, 2.05% ROI)\n\n**Last:** Kia -120 at Hanwha (Kia lost 4-3.)\n\nMy cold streak is now injuring pitchers. Kia's starter had a clean 1st inning and a 1-0 lead in the 2nd. After a walk and HBP, he was pulled for an injury and the bullpen immediately gave up 3 runs.\n\n**Pick:** SSG at **Doosan First 5 Innings ML -112 Unibet**, KBO baseball, 5:30am ET\n\nI was surprised by this line. SSG is a good team, but Doosan's starter is on another level right now. I'm tempred to take Doosan F5 -0.5 +130 on Draftkings, but I should take it easy considering the streak.\n\nSSG's starter is coming off two rough starts where he allowed 6 ER on 11 H and 5 BB in 9 IP. On the season, he has a 4.86 ERA and 1.51 WHIP.\n\nDoosan's starter is sporting a 1.29 ERA and 0.93 WHIP. Over his last 4 starts, he's allowed just 1 ER on 14 H and 3 BB with 24 K in 28 IP. Over his last 8 starts, it's only 4 ER in 52 IP.\n\nDoosan is 2nd in the league with 4.6 runs per game over their last 10 while SSG is 5th with 4.3.\n\nTail or fade, I wish you the best of luck. All wagers are 1 unit.",
    "upvotes": 6
  },
  {
    "author": "MrAtomicW",
    "body": "POTD Record 12-9 (+7 units) \n\nLast Pick: TOR VS TB / TB ML (-135) 3 units @ 10:10 am pst.✅\n\nTodays Pick: CHC VS CIN (-119) CHC ML 1 unit @ 11:20 am pst\n\nJordan Steele is 6-1 and 4-0 at home facing a pitcher who’s yet to win yet with a record of 0-4. I think these teams are evenly matched but the pitching here is going to make a difference in my opinion. 9 innings to glory! BOL!",
    "upvotes": 2
  },
  {
    "author": "Napoleon_Tannerite",
    "body": "Record 20-24 -.16 Units\n\nAll bets 1 unit\n\nLast 10: ❌✅✅❌❌✅❌❌❌❌\n\nLast Pick: Sox -1.5 (+120)\n\nI should’ve known better than to bet on White Sox. It’s too late to apologize to now. Time to bounce back.\n\nToday’s Pick: Pirates -1.5 vs. Mariners (+195)\n\nGoing back to ol reliable, fade the team who previously played the A’s. This is 9-5 on the year and 9-1 against teams not on a 6+ game winning streak or who are facing a better opponent than the White Sox.\n\nPirates:\n\nMitch Keller is starting for the Pirates. He is 5-1 with a 2.44 ERA with a .97 WHIP. Pitching shouldn’t be a problem here for the Pirates. Pirates are coming off a rough 2-3 loss against the. Rangers. They had 8 hits (avg 8.04) and 4 hits/run (avg 1.86). Hypothetically, we should see the Pittsburg be more efficient hitting wise this game. Keeping in mind this team has won their last two 1st games of the series, with one of those obliterating the Dbacks who also faced the A’s in the previous matchup.\n\nMariners:\n\nGeorge Kirby is starting for the Mariners. He is 5-3 with a 2.62 ERA and a 1.01 WHIP. Mariners have won 3 straight against the A’s, but previously had lost 4/5 games. Seattle isn’t a great hitting team, averaging 7.71 hits. However they capitalize on scoring with 1.70 hits/run.\n\nBoth of these pitchers are very similar statistically wise. It will come down to who has the better night hitting and which team hadn’t previously faced the A’s😏.\n\n(Tips link in bio)",
    "upvotes": 4
  },
  {
    "author": "sbpotdbot",
    "body": " 🗨 Respond to this comment with all POTD banter/bitching/discussion  \n\n&#x200B;\n\n&#x200B;\n\n 👇  👇  👇",
    "upvotes": 1
  }
]
